Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྒྱུ་སྐར་ གྱི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Tārarāja.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཤིན་ཏུ་ རྣམ་ [80b] པར་ འབྱེད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Suvibhakta. [80.b]

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཤིན་ཏུ་ ཡངས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $548 Situated beyond that universe was a universe known as Atyāyata.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བདུད་རྩི འི་ ཏོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Nectar Crest.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རིན་ཆེན་ ཏོག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Jewel Crest.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ འཇིགས་མེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $549 Situated beyond that universe was a universe known as Abhaya .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཙན་དན་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Candana.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བཟང་པོ འི་ དཔལ་ ཞེས་ བྱ་ བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Śrībhadra.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ དྲ་བ་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $550 Situated beyond that universe was a universe known as Jālinīprabha .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དྲ་བ་ ཅན་ གྱི་ འོད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Jālinīprabha .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ འོད་གསལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Ābhāsvara.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ འོད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $551 Situated beyond that universe was a universe known as Prabhā.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཚངས་པ འི་ ང་རོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone one, the worthy one, the perfect buddha Roar of Brahmā.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཚངས་ པ འི་ དབྱངས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Brahmāghoṣa.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མངོན་པར་ བགྲོད་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $552 Situated beyond that universe was a universe known as Traversal .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བདུད་རྩི་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Glorious Source of Nectar.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བདུད་རྩི འི་ དབྱངས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Amṛtaghoṣa.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ དམིགས་པ་ མེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $553 Situated beyond that universe was a universe known as Absence of Objective Perception.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དམིགས་པ་ ཀུན་ ལ་ དགྱེས་པ ར་ མཛད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Causing Delight in All Focal Points.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྟག་ ཏུ་ བསྒྲགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $554 Situated beyond that universe was a universe known as Constant Renown.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སེམས་ཅན་ ཐམས་ཅད་ [81a] ཀྱིས་ མི་ ཤིགས་པ འི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Armor That No Sentient Being Can Destroy. [81.a]

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྟག་ ཏུ་ བཟོད་ལྡན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $555 Situated beyond that universe was a universe known as Constant Possession of Patience.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྣམ་པར་ འཕྲུལ་པ་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Infinite Miraculous Display.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྤོབས་པ་ མི་ ཆོད་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Uninterrupted Eloquence.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀུན་ ཏུ་ མཐོང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $556 Situated beyond that universe was a universe known as Vision .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཆོས་ ཐམས་ཅད་ གཟིགས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Sarvadarśin.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མཚན་མ་ མེད་པ འི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Armor of the Absence of Signs.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀུན་ ཏུ་ བལྟ་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $557 Situated beyond that universe was a universe known as Viewing .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཆོས་ ཐམས་ཅད་ གཟིགས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Sarva­dharma­darśin.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ ཚབ་ རྣམ་པར་ དག་པ འི་ མིག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Perfectly Pure Eye.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོན་ཏན་ ཐམས་ཅད་ འབྱུང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $558 Situated beyond that universe was a universe known as Source of All Qualities.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ མཐའ་ ཡ ས་ འབྱུང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Source of Limitless Qualities.

source: བཅོམ་ ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མིག་ རྣམ་པར་ དག་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Eye That Is Perfectly Pure.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྡུལ་ དང་ བྲལ་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $559 Situated beyond that universe was a universe known as Viraja.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ འཕགས་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone King of Noble Wisdom.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ ཅན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Luminous Disk.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཨུད་པ་ ལས་ རབ་ཏུ་ ཁེབས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $560 Situated beyond that universe was a universe known as Covered by Utpalas.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ པད་མ འི་ མཆོག་ ཅེས་བྱ་བ་ [81b] བཞུགས་ ཏེ་
en: There resided the thus-gone Supreme Lotus. [81.b]

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཨུད་པ་ ལ་ དམར་པོ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Splendor of Red Utpalas.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མས་ རབ་ཏུ་ ཁེབས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $561 Situated beyond that universe was a universe known as Covered by Lotuses.

source: དེ་ ན་ དེ་ བཞིན་ གཤེགས་པ་ ཕྱོགས་ སུ་ འཕགས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Above All .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཕྱོགས་ ཀྱི་ ལྷུན་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Rising Above All.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མེ་ཏོག་ གིས་ རབ་ཏུ་ ཁེབས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $562 Situated beyond that universe was a universe known as Covered by Flowers.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མེ་ཏོག་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Splendor of Growing Flowers.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡིད་གཉིས་ ཐམས་ཅད་ ཡང་དག་ བཅོམ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Vanquishing All Doubts.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མར་མེ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $563 Situated beyond that universe was a universe known as Dīpa.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སེམས་ཅན་ གྱི་ སྙིང་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Essence of Sentient Beings.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྲེད་ མེད་ ཀྱི་ བུ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Nārāyaṇa.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ འོད་ བཟང་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $564 Situated beyond that universe was a universe known as Suprabha.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ ཀྱི་ འོད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Jñānaraśmi.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བདེ་འབྱུང་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Sukhākara.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བདེ་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $565 Situated beyond that universe was a universe known as Blissful Splendor.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ ཀྱི་ མེ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Wisdom Fire.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མཆོག་ གི་ ནོར་བུ་ ཅན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Supreme Jewel.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བདེ་བ་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $566 Situated beyond that universe was a universe known as Sukhāvatī.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མངལ་ མེད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Without Womb.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཆོས་ ཀྱི་ དབང་ཕྱུག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Dharmeśvara.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ངེས་ འདྲེན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $567 Situated beyond that universe was a universe known as Definitive Guidance. [82.a]

source: [82a] དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྨན་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Bhaiṣajyarāja.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྨན་པ འི་ མཆོག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Supreme Doctor.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཁ་དོག་ མེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $568 Situated beyond that universe was a universe known as Without Color.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཐ་དད་པ་ མེད་པ འི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Undivided Armor.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཐ་ མི་ དད་པ ར་ སྤྱོད་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Practice of Non-differentiation.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀུན་ ཏུ་ ཁ་དོག་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $569 Situated beyond that universe was a universe known as Abundant Colors.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ མཐའ་ ཡ ས་ གྲགས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Renown of Infinite Wisdom.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡོན་ཏན་ མཐའ་ ཡ ས་ འབྱུང་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_ |#| བཏང་ ངོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: This blessed one now dispatched his regent, the bodhisattva Source of Limitless Qualities , having prophesied the latter’s awakening to unsurpassable and perfect buddhahood.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མཚོ་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $570 Situated beyond that universe was a universe known as Endowed with Lakes.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཙན་དན་ གྱི་ བསུང་ གི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Splendid Sandalwood Fragrance.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡེ་ཤེས་ སྤོས་ ཀྱི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Splendid Incense of Wisdom.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ དཔེ་མེད་ དཔལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $571 Situated beyond that universe was a universe known as Anupamaśrī.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སངས་རྒྱས་ དཔེ་མེད་ མེ་ཏོག་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Incomparable Buddha Who Is a Splendorous Source of Flowers.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡང་དག་ འཕགས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Truly Noble.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་ཆེན་ ལྡན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $572 Situated beyond that universe was a universe known as Endowed with Jewels.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཤིན་ཏུ་ རབ་ཏུ་ གནས་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Supra­tiṣṭhita­rāja.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྡོམ་པ་ ལ་ རབ་ཏུ་ གནས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Observing the Vows.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཕྱོགས་ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $573 Situated beyond that universe was a universe known as Deśi. [82.b]

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ་ འཕགས་པ འི་ [82b] འོད་ཟེར་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Noble Moonlight.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཟླ་བ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །།_།།
en: This blessed one now dispatched his regent, the bodhisattva Candra.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྒྱ་མཚོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $574 Situated beyond that universe was a universe known as Sāgara .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཁ་ལོ་ སྒྱུར་བ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Sārathi.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མྱ་ངན་མེད་པ འི་ བློ་གྲོས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Intelligence Free from Suffering.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ལུས་ མཛད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Beautiful Body.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ དགའ་བ འི་ སྤོས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $576 Situated beyond that universe was a universe known as Incense of Joy.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྐྱོ་ མེད་ འགྱུར་བ ར་ མཛད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Dispeller of Sadness.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡོངས་ བསྒྲགས་ ཉོན་མོངས་ ཡང་དག་ བཅོམ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Renowned Conqueror of the Afflictions.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོན་ཏན་ ཀུན་ ལ་ རབ་ཏུ་ གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $577 Situated beyond that universe was a universe known as Presence of All Good Qualities.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྙན་པ འི་ བཤེས་གཉེན་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Spiritual Teacher of Pleasant Voice.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྒྱལ་བ འི་ བཤེས་གཉེན་ ཞེས་ བྱ་བ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས་ བཏང་ ངོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: This blessed one now dispatched his regent, the bodhisattva Jinamitra, having prophesied the latter’s awakening to unsurpassable and perfect buddhahood.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཕུན་སུམ་ ཚོགས་པ་ ཀུན་ ལ་ རབ་ཏུ་ གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $578 Situated beyond that universe was a universe known as Presence of All Perfections.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྙན་པ འི་ ང་རོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Melodious Roar.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མྱ་ངན་མེད་པ འི་ བློ་གྲོས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $579 Situated beyond that universe was a universe known as Intelligence Free from Suffering .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མྱ་ངན་ བྲལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Vigataśoka .

source: [83a] བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རིན་ཆེན་ མེ་ ཞེས་ བྱ་བ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས་ བཏང་ ངོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: This blessed one now dispatched the bodhisattva Jewel Fire , having prophesied the latter’s awakening to unsurpassable and perfect buddhahood.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྙན་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $580 Situated beyond that universe was a universe known as Melodious .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ པད་མ་ མངོན་པར་ འཕགས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Glorious Noble Lotus.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མེ་ཏོག་རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Flower King.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མེ་ཏོག་ ཀུན་ ཏུ་ བཀྲམ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $581 Situated beyond that universe was a universe known as Studded with Flowers.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མེ་ཏོག་ རབ་ཏུ་ གཏོར་བ འི་ ཏོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་ |#| འཚོ་ ཞིང་ གཞེས་ ལ་ ཆོས་ ཀྱང་ སྟོན་ ཏེ །_
en: There resided the thus-gone Crest of Tossed Flowers. |#| Abiding and remaining present there, he taught the Dharma.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྤོས་ ཀྱི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Incense Splendor.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ རྣམ་པར་ བསྒྲགས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $582 Situated beyond that universe was a universe known as Vikhyāta.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ནས་ སྤོས་ ཀྱི་ འོད་ཟེར་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Radiant Incense .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ངེས་འབྱུང་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Niryāṇa.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཕྱོགས་ ལྡན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $583 Situated beyond that universe was a universe known as Pakṣiṇī.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྤྱན་ བཏུད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Revered Eyes.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྨོན་ལམ་ ཆེན་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Mahāpraṇidhāna.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ འོད་འཕྲོ་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $584 Situated beyond that universe was a universe known as Radiant .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འོད་ བཏང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Sender of Light.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྦྱིན་ བསྲེགས་ བྱས་པ འི་ འོད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Light of Homa.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འོད་ ལྷུན་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Mountain of Light.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རི་རབ་ ལྟ་བུ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Meru-like.

source: དེ འི་ ཡང་ འདབ་ཆགས་ [83b] ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་པོ་ཆེ འི་ འོད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $586 Situated beyond that universe [83.b] was a universe known as Jewel Light.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ སྣང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Ratnāloka.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རིན་ཆེན་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Ratnadatta.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྟག་ ཏུ་ བདུག་སྤོས་ བདུགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $587 Situated beyond that universe was a universe known as Constant Fumes of Incense.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མཚན་ གཉིས་ གཙུག་ཏོར་ཅན་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Twice-Marked Crest Bearer.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ མཚན་ གཉིས་ འོད་ ཅེས་བྱ་བ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས་ བཏང་ ངོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: This blessed one now dispatched his regent, the bodhisattva Twice-Marked Light, having prophesied the latter’s awakening to unsurpassable and perfect buddhahood.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྲིད་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $588 Situated beyond that universe was a universe known as Bhava.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འཇིག་རྟེན་ གསུམ་ གྱི་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Powerful Leader of the Three Realms.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྲིད་པ་ གསུམ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Tribhava.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མི་ འཇིགས་ སྦྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Abhayapradā.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྟག་ ཏུ་ དམིགས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $590 Situated beyond that universe was a universe known as Constant Observation.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ནམ་མཁ འི་ རིགས་ ཀྱི་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Leader of the Sky Family.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ལག་པ་ ཅན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Hastaka.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བདེ་བ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $591 Situated beyond that universe was a universe known as Sukharāja .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཟད་ མི་ ཤེས་པ འི་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Inexhaustible Leader.

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ [84a] ཏོ་ ཞེས་ བྱ་བ་ ནས་ བཏང་ ངོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: This blessed one, worthy one, perfect buddha now dispatched the bodhisattva Glorious Source , having prophesied the latter’s awakening to unsurpassable and perfect buddhahood. [84.a]

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀུན་ ཏུ་ ཡོངས་སུ་ སྤངས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $592 Situated beyond that universe was a universe known as Total Relinquishment.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྔ་སྒྲ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Sound of the Drum.

source: བཅོམ་ ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྤོས་ རབ་ གཏོང་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Incense Sender.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ཏུ་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Leader in All Regards.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡུལ་ ལ་ མི་ གནས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched the bodhisattva Not Involved with Objects.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྒྲ་ རྣམ་པར་ བསྒྲགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $594 Situated beyond that universe was a universe known as Vikhyāta.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ རྣམ་པར་ བསྒྲགས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Wisdom Renown .

source: བཅོམ་ལྡན་ འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མཆོག་ གི་ ཚོགས་ཅན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Supreme Accumulations.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྒྲོན་མ འི་ དཀྱིལ་འཁོར་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $595 Situated beyond that universe was a universe known as Lamp Sphere.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཤིན་ཏུ་ རབ་ཏུ་ གནས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Supratiṣṭhita .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་པ་ ར་ ཛཱ་ ན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Parajana.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བཀོད་པ་ གཅིག་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $596 Situated beyond that universe was a universe known as Single Array .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སངས་རྒྱས་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Buddha Leader.
